In [1]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [2]:
df = pd.DataFrame({
    'id' : ['23', '96', '97', '15', '87'],
    'name' : ['computer', 'Python Workout', 'Pandas Workout', 'banana', 'sandwich'],
    'wholesale_price' : [500, 35, 35, 0.5, 3],
    'retail_price' : [1000, 75, 75, 1, 5],
    'sales' : [100, 1000, 500, 200, 300]
})

df

   id            name  wholesale_price  retail_price  sales
0  23        computer            500.0          1000    100
1  96  Python Workout             35.0            75   1000
2  97  Pandas Workout             35.0            75    500
3  15          banana              0.5             1    200
4  87        sandwich              3.0             5    300

In [3]:
tax_df = df.assign(current_net_revenue = (df['retail_price'] - df['wholesale_price']) * df['sales'])
# NOTE: the .assign method returns a new data frame rather than modifying an existing one

tax_df['after_15'] = tax_df['current_net_revenue'] * 0.85
tax_df['after_20'] = tax_df['current_net_revenue'] * 0.8
tax_df['after_25'] = tax_df['current_net_revenue'] * 0.75

tax_df

,id,name,wholesale_price,retail_price,sales,current_net_revenue,after_15,after_20,after_25
0,23,computer,500.0,1000,100,50000.0,42500.0,40000.0,37500.0
1,96,Python Workout,35.0,75,1000,40000.0,34000.0,32000.0,30000.0
2,97,Pandas Workout,35.0,75,500,20000.0,17000.0,16000.0,15000.0
3,15,banana,0.5,1,200,100.0,85.0,80.0,75.0
4,87,sandwich,3.0,5,300,600.0,510.0,480.0,450.0

In [4]:
tax_df[['current_net_revenue', 'after_15', 'after_20', 'after_25']].sum()

current_net_revenue    110700.0
after_15                94095.0
after_20                88560.0
after_25                83025.0
dtype: float64

### Beyond the exercise_1

In [5]:
# An alternative tax plan would charge a 25% tax, but only on products from
# which you would net more than 20,000. In such a case, how much would you make?

tax_df['conditional_25'] = tax_df['current_net_revenue'].apply(lambda x: x if x < 20000 else x * 0.75)

tax_df[['current_net_revenue', 'after_15', 'after_20', 'after_25', 'conditional_25']].sum()

current_net_revenue    110700.0
after_15                94095.0
after_20                88560.0
after_25                83025.0
conditional_25          83200.0
dtype: float64

### Beyond the exercise_2

In [8]:
# Yet another alternative tax plan would charge a 25% tax on products whose
# retail price is greater than 80, a 10% tax on products whose retail price is
# between 30 and 80, and no tax on other products. Implement and calculate the result of such a tax scheme.

tax_df['condition_tax_2'] = (
    np.where(tax_df['retail_price'] > 80, 0.75,
    np.where(
        (tax_df['retail_price'] > 30) & (tax_df['retail_price'] < 80), 0.9,
        1)
))

tax_df['condition_tax_2_net_revenue'] = tax_df['current_net_revenue'] * tax_df['condition_tax_2']

tax_df[['current_net_revenue', 'after_15', 'after_20', 'after_25', 'conditional_25', 'condition_tax_2_net_revenue']].sum()

current_net_revenue            110700.0
after_15                        94095.0
after_20                        88560.0
after_25                        83025.0
conditional_25                  83200.0
condition_tax_2_net_revenue     92200.0
dtype: float64

### Beyond the exercise_3

In [ ]:
# These long floating-point numbers are getting hard to read. Set the float_format option
# in pandas such that floating-point numbers will be displayed with
# commas every three digits before the decimal point and only two digits after the
# decimal point. Note that this is tricky because it requires understanding Python
# callables and the str.format method.

# NOTE: i asked this from a LLM
pd.set_option('display.float_format', '{:,.2f}'.format)

tax_df

,id,name,wholesale_price,retail_price,sales,current_net_revenue,after_15,after_20,after_25,conditional_25,condition_tax_2,condition_tax_2_net_revenue
0,23,computer,500.00,1000,100,"50,000.00","42,500.00","40,000.00","37,500.00","37,500.00",0.75,"37,500.00"
1,96,Python Workout,35.00,75,1000,"40,000.00","34,000.00","32,000.00","30,000.00","30,000.00",0.90,"36,000.00"
2,97,Pandas Workout,35.00,75,500,"20,000.00","17,000.00","16,000.00","15,000.00","15,000.00",0.90,"18,000.00"
3,15,banana,0.50,1,200,100.00,85.00,80.00,75.00,100.00,1.00,100.00
4,87,sandwich,3.00,5,300,600.00,510.00,480.00,450.00,600.00,1.00,600.00